{
  "selectedTemplate": 1,
  "headings": {
    "awards": "",
    "skills": "Technologies"
  },
  "basics": {
    "name": "Abhay Maniyar",
    "email": "abhaymaniyar@live.in",
    "phone": "+91-8770872320",
    "location": {
      "address": "Bangalore, KA, India"
    },
    "website": "http://abhaymaniyar.github.io/"
  },
  "education": [
    {
      "location": "Indore, MP, India",
      "area": "Computer Science and Engineering ",
      "studyType": "Bachelor of Engineering",
      "startDate": "Aug 2014",
      "endDate": "Jun 2018",
      "gpa": "7.09",
      "institution": "Shri Vaishnav Institute of Technology and Science"
    },
    {
      "institution": "Padmaja Higher Secondary School",
      "location": "Dewas, MP, India",
      "studyType": "Higher Secondary School",
      "gpa": "88.2%",
      "endDate": "2014",
      "startDate": "2013"
    },
    {
      "institution": "Padmaja Higher Secondary School",
      "location": "Dewas, MP, India",
      "studyType": "High School",
      "gpa": "89%",
      "endDate": "2012",
      "startDate": "2011"
    }
  ],
  "work": [
    {
      "highlights": [
        "Skills: Golang, Python, ReactJS, PHP, Ruby, Wordpress, Woocommerce",
        "Leading the effort to refactor internal service layers to support Magento merchants on our checkout system.",
        "Led the effort to stablize the Simpl-Checkout WooCommerce plugin resulting in onboarding 2 times more merchants to use Simpl as their checkout partner.",
        "Spearheaded the effort of creating backend for merchant dashboard containing different transaction metrics for each merchant.",
        "Worked on creating frontend for merchant dashboard containing different transaction metrics for each merchant.",
        "Was PoC for backend-for-frontend service which provide high availability and scalability to web and app clients.",
        "Mentored juniors in the teams I worked in, provided them with system and business context to get them up to speed.",
        "Worked on creating customizable user onboarding journeys and experiments.",
        "Leading the effort to make the current codebase more readable and maintainable.",
        "Worked closely with analytics team to make sure the data accuracy of events for checkout and payment metrics.",
        "Utilized FastAPI and Python for backend development and worked on frontend projects using ReactJS."
      ],
      "company": "Simpl",
      "position": "Senior Software Engineer",
      "location": "Bengaluru, KA, India",
      "startDate": "Sept, 2021",
      "endDate": "Present"
    },
    {
      "highlights": [
        "Skills: Java, Golang, MySQL, .NET, NodeJS",
        "Worked on Bolt project. Using Bolt a customer can utilise the CL through UPI and repay the loan as amontly bill payment like one does for credit cards.",
        "Integrated UPI system powered by IDFC bank to enable customers to use their Credit Limit more easilyusing their UPI ID.",
        "Mentored freshers and interns on understanding Zestmoney’s system and made sure they becomecomfortable with the engineering process.",
        "Worked with the team on a high performance state engine written in Golang. This enabled us toconfigure different loan journeys with almost no code changes. This is built as a SaaS product and canbe configured for different banks for onboarding their customers on a digital lending journey.",
        "Worked on Video KYC module and it’s end to end delivery for a partner bank. It was challenging tohandle all the drop off scenario in this project.",
        "Enabled customers to have insurance for the loans they opt for using ZestMoney.",
        "Created REST APIs in a microservice working as a middleware for mobile app and building blockservices. The APIs were written in Loopback4(nodejs).",
        "Worked on improving the cashback system and enabled features like cashback on EMI repayment andloan preclosure and customer referral cashback.",
        "Certain services required a migration from .NET to Spring like the one named as ApplicationFlowwhich was the service dedicated to handle the loan application level stuff. Worked on that alongside theBAU tasks.",
        "Delivered talks on subjects like Clean Code and effective use of Postman.",
        "Built a habit of creating flow diagrams and maintain documentation of the modules/stories I worked on.This helped new team members to gain insights on the product as well as helped me to revisit the flowwhenever required.",
        "Helped in hiring as an active interviewer for tech roles."
      ],
      "company": "ZestMoney",
      "location": "Bengaluru, KA, India",
      "startDate": "April, 2019",
      "endDate": "Sept, 2021",
      "position": "SDE-II"
    },
    {
      "highlights": [
        "Worked on VoIP servers to add more features and fix bugs.",
        "Added new automations and scripts in the server softwares to reduce time consumption on daily tasks.",
        "Learned new things about Linux OS and scripting."
      ],
      "company": "Ribbon Communications",
      "location": "Bengaluru, KA, India",
      "startDate": "Aug 2018",
      "endDate": "April, 2019",
      "position": "Software Engineer"
    },
    {
      "position": "Senior Intern",
      "website": "",
      "startDate": "Nov 2017",
      "highlights": [
        "Worked on app's frontend and Laravel backend for InnerVoice App.",
        "Made the app more stable, fixed the bugs based on the analysis of ANRs and crashes on Crashlytics.",
        "Collaborated with team in planning and addition of new features to the InnerVoice project."
      ],
      "company": "WittyFeed, Vatsana Technologies",
      "location": "Indore, MP, India",
      "endDate": "Mar 2018"
    },
    {
      "highlights": [
        null,
        null,
        null
      ],
      "company": "DuckDuckGo and Zulip",
      "position": "Open Source Contributor",
      "startDate": "Mar 2017",
      "endDate": "Aug 2017"
    },
    {
      "highlights": [
        null,
        null
      ],
      "company": "HotWax Systems",
      "location": "Indore, MP, India",
      "position": "Intern",
      "startDate": "Aug 2016",
      "endDate": "Jul 2017"
    }
  ],
  "skills": [
    {
      "level": "",
      "keywords": [
        "Java",
        "Golang",
        "C/C++",
        "Python",
        "Data Structures",
        "Algorithms"
      ],
      "name": "Programming Languages"
    },
    {
      "keywords": [
        "Spring Boot",
        "Android",
        "Django",
        "Laravel",
        "Angular"
      ],
      "name": "Frameworks"
    },
    {
      "keywords": [
        "Microservices",
        "AWS",
        "Git",
        "Sumologic",
        "Docker",
        "REST API",
        "NewRelic",
        "QuickView"
      ],
      "name": "Others"
    },
    {
      "keywords": [
        ""
      ]
    }
  ],
  "awards": [
    {
      "title": "Coding Champ",
      "awarder": "Tata Consultancy Services",
      "summary": "Recognized for entering semifinal round of international coding competition 'CodeVita VI'",
      "date": "Sep 2017"
    },
    {
      "title": "RedFM Radio Feature",
      "summary": "Got featured on RedFM, Indore for development of social welfare application Blood Donors United."
    }
  ],
  "sections": [
    "templates",
    "profile",
    "education",
    "work",
    "skills",
    "awards"
  ]
}